In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import sklearn #scikit learn

In [5]:
## Importing the Dataset
data =pd.read_table("http://bit.ly/movieusers")
data.head(2)

  1|24|M|technician|85711
0      2|53|F|other|94043
1     3|23|M|writer|32067

In [7]:
data =pd.read_table("http://bit.ly/movieusers",sep="|")
data.head(2)

   1  24  M technician  85711
0  2  53  F      other  94043
1  3  23  M     writer  32067

In [8]:
data =pd.read_table("http://bit.ly/movieusers",sep="|",header=None)
data.head(2)

   0   1  2           3      4
0  1  24  M  technician  85711
1  2  53  F       other  94043

### Handling the Missing Values

In [9]:
df=pd.read_csv("https://raw.githubusercontent.com/Mounika-Kajjam/Datasets/master/weather_data.csv")
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [11]:
df['temperature']

0       32
1   -99999
2       28
3   -99999
4       32
5       31
6       34
Name: temperature, dtype: int64

In [14]:
#Mode (repeated frequency of column values is returned)
df['temperature'].value_counts() 
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [16]:
df.day.dtype

dtype('O')

In [17]:
type(df.day[0])

str

In [19]:
#checking for dupilcate values
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [20]:
df[df.duplicated()]

Empty DataFrame
Columns: [day, temperature, windspeed, event]
Index: []

In [21]:
df['temperature'].duplicated()

0    False
1    False
2    False
3     True
4     True
5    False
6    False
Name: temperature, dtype: bool

In [23]:
# checking for duplicate values of specific column
df[df['temperature'].duplicated()] # o/p are the duplicated values

        day  temperature  windspeed event
3  1/4/2017       -99999          7     0
4  1/5/2017           32     -99999  Rain

In [24]:
df[df['event'].duplicated()]

        day  temperature  windspeed  event
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [25]:
df['event'].value_counts()

0        2
Sunny    2
Rain     2
Snow     1
Name: event, dtype: int64

In [26]:
df=pd.read_csv("https://raw.githubusercontent.com/Mounika-Kajjam/Datasets/master/weather_data.csv",parse_dates=['day'])
df

         day  temperature  windspeed  event
0 2017-01-01           32          6   Rain
1 2017-01-02       -99999          7  Sunny
2 2017-01-03           28     -99999   Snow
3 2017-01-04       -99999          7      0
4 2017-01-05           32     -99999   Rain
5 2017-01-06           31          2  Sunny
6 2017-01-06           34          5      0

In [27]:
df.day.dtype

dtype('<M8[ns]')

In [28]:
type(df.day[0])

pandas._libs.tslibs.timestamps.Timestamp

In [30]:
new_df=df.replace({'temperature':-99999,'windspeed':-99999,"event":'0'},np.nan)
new_df

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          NaN        7.0  Sunny
2 2017-01-03         28.0        NaN   Snow
3 2017-01-04          NaN        7.0    NaN
4 2017-01-05         32.0        NaN   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

### Imputation: imputation is a process of substituting the missing values

In [53]:
new_df.isnull().sum()

day            0
temperature    2
windspeed      2
event          2
dtype: int64

In [54]:
#fillna() is a function which is used to  fill the missing values
new_df.fillna(0)
new_df

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          NaN        7.0  Sunny
2 2017-01-03         28.0        NaN   Snow
3 2017-01-04          NaN        7.0    NaN
4 2017-01-05         32.0        NaN   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [55]:
new_df.fillna(method='ffill')  #forward fill

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         32.0        7.0  Sunny
2 2017-01-03         28.0        7.0   Snow
3 2017-01-04         28.0        7.0   Snow
4 2017-01-05         32.0        7.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0  Sunny

In [56]:
new_df

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          NaN        7.0  Sunny
2 2017-01-03         28.0        NaN   Snow
3 2017-01-04          NaN        7.0    NaN
4 2017-01-05         32.0        NaN   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [57]:
# bfill--> back fill
new_df.fillna(method='bfill')

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         28.0        7.0  Sunny
2 2017-01-03         28.0        7.0   Snow
3 2017-01-04         32.0        7.0   Rain
4 2017-01-05         32.0        2.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [58]:
# replace nan values with the mean of the corresponding column
new_df.mean()

temperature    31.4
windspeed       5.4
dtype: float64

In [60]:
mean_data=new_df.fillna(new_df.mean())
mean_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         31.4        7.0  Sunny
2 2017-01-03         28.0        5.4   Snow
3 2017-01-04         31.4        7.0    NaN
4 2017-01-05         32.0        5.4   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [61]:
#median imputation
median_data=new_df.fillna(new_df.median())
median_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         32.0        7.0  Sunny
2 2017-01-03         28.0        6.0   Snow
3 2017-01-04         32.0        7.0    NaN
4 2017-01-05         32.0        6.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [62]:

new_df.event.mode()

0     Rain
1    Sunny
dtype: object

In [63]:

new_df['event']=new_df['event'].fillna(new_df.event.mode().iloc[0])
new_df

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          NaN        7.0  Sunny
2 2017-01-03         28.0        NaN   Snow
3 2017-01-04          NaN        7.0   Rain
4 2017-01-05         32.0        NaN   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0   Rain

In [34]:
import numpy as np
arr1=np.array([[ 19,7,19,93],
                [94,18,4,22],
                [5,21,95,17],
                [20,92,20,6]])
arr1.sum(axis=1) #sum of columns is 138
arr1.sum(axis=1) # sum of rows is 138

array([138, 138, 138, 138])

In [37]:
arr2=np.array([[ 16,10,19,99],
                [100,18,7,19],
                [8,18,101,17],
                [20,98,17,9]])
arr2.sum(axis=1)

array([144, 144, 144, 144])

In [39]:
#forword diagonal sum
arr2.trace(axis1=0,axis2=1)

144

In [47]:
#sum of middle square is 144
s=0
for i in range(1,3):
    for j in range(1,3):
        s+=arr2[i,j]
s

144

In [48]:
#sum of corner elements is 144
arr2[0,0]+arr2[0,3]+arr2[3,0]+arr2[3,3]

144

In [52]:
f=0
b=0
for i in range(4):
    for j in range(4):
        if i==j:
            f+=arr2[i,j]
        if i+j==3:
            b+=arr2[i,j]
            
print(f)
print(b)

144
144

In [59]:
s=0
for i in range(2):
    for j in range(2):
        s+=arr2[i,j]
s

144